{
  "asignatura": "10",
  "nivel": "General",
  "units": [
    {
      "unit_title": "Programación",
      "ui_family": "HARD_TECH",
      "learning_outcome": {
        "text": "Aplica principios fundamentales de programación para diseñar y construir soluciones básicas de software que resuelvan problemas definidos.",
        "code": "LO_PROGRAM_01"
      },
      "mediation_strategies": [
        {
          "moment": "Conexión",
          "teacher_action": "Presenta un desafío de programación del mundo real o un problema a resolver, modelando el proceso inicial de pensamiento lógico.",
          "student_action": "Analiza el problema, identifica los requisitos clave y explora posibles enfoques algorítmicos basados en conocimientos previos.",
          "dua_suggestion": "focus_mode",
          "risk_protocol_linked": false
        },
        {
          "moment": "Colaboración",
          "teacher_action": "Facilita discusiones grupales sobre el diseño del algoritmo, proporcionando sugerencias y desafiando suposiciones, guiando la revisión por pares de las soluciones propuestas.",
          "student_action": "Trabaja con compañeros para generar ideas y refinar diseños algorítmicos, discutiendo ventajas y desventajas y presentando soluciones preliminares.",
          "dua_suggestion": "structure_mode",
          "risk_protocol_linked": false
        },
        {
          "moment": "Construcción",
          "teacher_action": "Reta a los estudiantes a implementar sus diseños en código, ofreciendo apoyo técnico individualizado y depurando errores comunes.",
          "student_action": "Diseña y construye soluciones de software aplicando los principios de programación, realizando pruebas y refactorizando el código.",
          "dua_suggestion": "challenge_mode",
          "risk_protocol_linked": false
        },
        {
          "moment": "Clarificación",
          "teacher_action": "Guía la reflexión sobre las soluciones desarrolladas, identificando las mejores prácticas y conectando los conceptos aprendidos con paradigmas de programación más amplios.",
          "student_action": "Presenta y justifica sus soluciones desarrolladas, reflexiona sobre el proceso de aprendizaje e identifica áreas de mejora y aplicación futura.",
          "dua_suggestion": "focus_mode",
          "risk_protocol_linked": false
        }
      ],
      "evaluation": {
        "instrument_type": "Rúbrica",
        "requires_instrument": true
      }
    }
  ]
}