[
    {
        "jsonbData": {
            "header": {
                "docente": "[Nombre del Docente]",
                "institucion": "[Institución]",
                "logo": "[Logo Institucional]",
                "periodo": "2026"
            },
            "unit": "Unidad de Estudio: Arquitectura de Aplicaciones Web y Servicios (Backend)",
            "estimated_time": "80 Horas",
            "learning_outcomes": [
                {
                    "id": "RA-01",
                    "description": "Desarrollar arquitecturas de backend robustas utilizando patrones de diseño y marcos de trabajo (Frameworks).",
                    "saberes": [
                        "Patrón MVC (Modelo-Vista-Controlador)",
                        "Inyección de dependencias",
                        "Servidores de aplicaciones (Node.js/Express o .NET)",
                        "Middleware"
                    ],
                    "indicators": [
                        "Construye la lógica de servidor de una aplicación web aplicando patrones de diseño para asegurar la escalabilidad."
                    ],
                    "mediation_strategies": {
                        "free_teaser": {
                            "teacher_role": "La persona docente modela la creación de una API RESTful y ejemplifica el flujo de una petición (Request/Response).",
                            "student_role": "La persona estudiante observa el flujo y modifica rutas básicas en el servidor."
                        },
                        "pro_full": [
                            {
                                "phase": "Arquitectura de Capas",
                                "teacher_role": "La persona docente explica la inyección de dependencias y la separación de responsabilidades en el controlador.",
                                "student_role": "La persona estudiante estructura el backend de una aplicación y desarrolla los controladores para gestionar la lógica de negocio."
                            }
                        ],
                        "variants": [
                            {
                                "type": "Lúdica",
                                "label": "El Hacker Blanco (White Hat)",
                                "description": "Los estudiantes intentan encontrar fallos de seguridad en las APIs de sus compañeros (Cross-Site Scripting, Inyección) para ganar puntos."
                            }
                        ]
                    },
                    "evidence": "Estructura de carpetas del proyecto y archivos de configuración del servidor."
                },
                {
                    "id": "RA-02",
                    "description": "Implementar servicios de persistencia de datos mediante el uso de ORM y bases de datos relacionales/no relacionales.",
                    "saberes": [
                        "ORM (Prisma/Sequelize/Entity Framework)",
                        "Migraciones",
                        "Relaciones (1:1, 1:N, N:N)",
                        "Seguridad de conexión (SSL/TLS)"
                    ],
                    "indicators": [
                        "Gestiona la persistencia de datos en aplicaciones web utilizando herramientas de mapeo objeto-relacional."
                    ],
                    "mediation_strategies": {
                        "free_teaser": {
                            "teacher_role": "La persona docente ilustra el mapeo objeto-relacional básico.",
                            "student_role": "La persona estudiante visualiza modelos de datos en un ORM."
                        },
                        "pro_full": [
                            {
                                "phase": "Persistencia Avanzada",
                                "teacher_role": "La persona docente proporciona mejores prácticas para la protección de cadenas de conexión y SSL.",
                                "student_role": "La persona estudiante diseña el esquema de la base de datos y ejecuta las migraciones para sincronizar el modelo."
                            }
                        ],
                        "variants": [
                            {
                                "type": "STEAM",
                                "label": "Data Viz Art",
                                "description": "La persona docente y la persona estudiante crean visualizaciones artísticas de cómo fluyen los datos en la red."
                            }
                        ]
                    },
                    "evidence": "Esquema de base de datos visual y código fuente de los modelos de datos."
                },
                {
                    "id": "RA-03",
                    "description": "Asegurar los puntos de acceso (Endpoints) mediante protocolos de autenticación y autorización.",
                    "saberes": [
                        "JWT (JSON Web Tokens)",
                        "OAuth 2.0",
                        "Hashing de contraseñas (Bcrypt)",
                        "Manejo de CORS y variables de entorno"
                    ],
                    "indicators": [
                        "Implementa mecanismos de seguridad en el backend para proteger la integridad y privacidad de la información."
                    ],
                    "mediation_strategies": {
                        "free_teaser": {
                            "teacher_role": "La persona docente demuestra el hashing de contraseñas.",
                            "student_role": "La persona estudiante registra usuarios aplicando librerías de encriptación básicas."
                        },
                        "pro_full": [
                            {
                                "phase": "Seguridad en Capas",
                                "teacher_role": "La persona docente demuestra la implementación de JWT y explica la diferencia entre autenticación y autorización.",
                                "student_role": "La persona estudiante integra middleware de seguridad en las rutas y valida tokens de acceso."
                            }
                        ]
                    },
                    "dua_strategies": [
                        {
                            "population": "Baja Visión / Diversidad",
                            "teacher_role": "La persona docente utiliza temas de alto contraste y facilita lectores de código (Voice-Over).",
                            "student_role": "La persona estudiante navega la estructura del proyecto usando el lector y marcando puntos críticos en el código."
                        },
                        {
                            "population": "Alta Dotación / Potencial",
                            "teacher_role": "La persona docente propone el despliegue en la nube usando contenedores.",
                            "student_role": "La persona estudiante orquesta microservicios y despliega la aplicación de backend en AWS/Azure/GCP."
                        }
                    ],
                    "evidence": "Módulo de autenticación funcional y pruebas de Postman."
                }
            ],
            "evaluation_instruments": [
                {
                    "type": "Rubric",
                    "title": "Rúbrica Técnica: Calidad y Seguridad del Código",
                    "is_premium": true,
                    "criteria": [
                        {
                            "name": "Arquitectura Backend",
                            "levels": {
                                "inicial": "El código funciona pero no usa patrones MVC.",
                                "intermedio": "Aplica MVC pero con lógica de negocio en controladores.",
                                "avanzado": "Implementa inyección de dependencias y servicios desacoplados."
                            }
                        }
                    ]
                },
                {
                    "type": "Task",
                    "title": "Tarea: Análisis de Vulnerabilidades OWASP",
                    "is_premium": false,
                    "challenge": "Analizar las vulnerabilidades OWASP Top 10 y proponer mitigaciones para el proyecto actual."
                },
                {
                    "type": "Project",
                    "title": "Proyecto Final: Plataforma de E-commerce Segura",
                    "is_premium": true,
                    "description": "Backend completo con base de datos, autenticación JWT y documentación técnica con Swagger."
                }
            ]
        },
        "mepMetadata": {
            "subject": "Programación de Software",
            "grade_level": "12",
            "module_id": "SW-PROG-12",
            "module_name": "Tecnologías de la Información - Programación",
            "source": "Sovereign Curriculum Engine V2.0",
            "curriculum_year": 2026,
            "mnc_level": 4,
            "mnc_code": "TIC-DSO-N4-01",
            "modalities": [
                "Diurna",
                "Nocturna",
                "IPEC",
                "CINDEA"
            ],
            "privacy_standard": "Verified (No PII)",
            "tier_logic": "Hybrid (Free Teaser / Pro Full)",
            "unit_id": "SW-PROG-12-U01"
        },
        "logicRules": {
            "sequence": [
                "RA-01",
                "RA-02",
                "RA-03"
            ],
            "prerequisites": [
                "Desarrollo de Aplicaciones 11vo"
            ],
            "steam_focus": "Arquitectura de Software & Ciberseguridad"
        },
        "classificationTags": [
            "Desarrollo de Software",
            "Backend",
            "Node.js",
            "Express",
            "Prisma",
            "JWT",
            "MNC N4"
        ]
    }
]